#+title: Lindoma
#+STARTUP: overview
#+CONSTANTS: halflevel=0

* Abilities
#+TBLNAME: Abilities
| Ability | Score | Mod | + 1/2 lvl |
|---------+-------+-----+-----------|
| STR     |    10 |   0 |         0 |
| CON     |    16 |   3 |         3 |
| DEX     |    10 |   0 |         0 |
| INT     |    14 |   2 |         2 |
| WIS     |    11 |   0 |         0 |
| CHA     |    18 |   4 |         4 |
#+TBLFM: $3=floor(($2-10)/2);N
#+TBLFM: $4=($3 + $halflevel);N


* Defense
| Total | Def  | Base | Arm | Abil | Mod | Class | Feat | Enh | Misc | Temp |
|-------+------+------+-----+------+-----+-------+------+-----+------+------|
|    13 | AC   |   10 |   3 | DEX  |   0 |       |      |     |      |      |
|    14 | FORT |   10 |     | CON  |   3 |     1 |      |     |      |      |
|    13 | REF  |   10 |     | INT  |   2 |     1 |      |     |      |      |
|    14 | WILL |   10 |     | CHA  |   4 |       |      |     |      |      |
#+TBLFM: $3=(10 + $halflevel)
#+TBLFM: $6='(or (org-lookup-first $5 '(remote(Abilities,@2$1..@>$1)) '(remote(Abilities,@2$3..@>$3))) "")
#+TBLFM: $1=($3 + $4 + $6 + $7 + $8 + $9 + $10 + $11)
*** Attack
#+TBLNAME: attack
| Weapon/Power        | Attack | Abil | Mod+ | Class | Prof | Feat | Enh | Misc |
|                     |        |      | 1/2L |       |      |      |     |      |
|---------------------+--------+------+------+-------+------+------+-----+------|
| Guiding Strike      |     +8 | CHA  |    4 |       |    3 |    1 |     |      |
| Melee Basic Attack  |     +4 | STR  |    0 |       |    3 |    1 |     |      |
| Ranged Basic Attack |     +4 | DEX  |    0 |       |    3 |    1 |     |      |
| Shout of Triumph    |     +4 | CHA  |    4 |       |      |      |     |      |
| Slayer's Song       |     +8 | CHA  |    4 |       |    3 |    1 |     |      |
| War Song Strike     |     +8 | CHA  |    4 |       |    3 |    1 |     |      |
#+TBLFM: $4='(or (org-lookup-first $3 '(remote(Abilities,@2$1..@>$1)) '(remote(Abilities,@2$4..@>$4))) "")
#+TBLFM: $2='(concat "+" (int-to-string (+ $4 $5 $6 $7 $8 $9)));N
- Bonuses
  - Weapon Expertise: Longsword: +1 feat bonus to attack
  - Weapon Expertise: Longbow: +1 feat bonus to attack
  - Bard is proficient in longsword, military ranged

*** Damage
#+TBLNAME: damage
| Weapon/Power        | Bonus | Abil | Mod | Feat | Enh | Misc | Misc |
|---------------------+-------+------+-----+------+-----+------+------|
| Guiding Strike      |    +4 | CHA  |   4 |      |     |      |      |
| Melee Basic Attack  |    +0 | STR  |   0 |      |     |      |      |
| Ranged Basic Attack |    +0 | DEX  |   0 |      |     |      |      |
| Shout of Triumph    |    +4 | CHA  |   4 |      |     |      |      |
| Slayer's Song       |    +4 | CHA  |   4 |      |     |      |      |
| War Song Strike     |    +4 | CHA  |   4 |      |     |      |      |
#+TBLFM: $4='(or (org-lookup-first $3 '(remote(Abilities,@2$1..@>$1)) '(remote(Abilities,@2$3..@>$3))) "")
#+TBLFM: $2='(concat "+" (int-to-string (-sum '($4 $5 $6 $7))));N
- Bonsues
  - --

* Skills
| Mod | Name          | Abil. | Train | Mod+ | Armor | Misc | Temp |
|     |               |       |       | 1/2L |       |      |      |
|-----+---------------+-------+-------+------+-------+------+------|
|  +1 | Acrobatics    | DEX   |       |      |       |    1 |      |
|  +7 | Arcana        | INT   |     5 |    2 |       |      |      |
|  +1 | Athletics     | STR   |       |      |       |    1 |      |
|  +5 | Bluff         | CHA   |       |    4 |       |    1 |      |
| +11 | Diplomacy     | CHA   |     5 |    4 |       |    2 |      |
|  +1 | Dungeoneering | WIS   |       |      |       |    1 |      |
|  +4 | Endurance     | CON   |       |    3 |       |    1 |      |
|  +1 | Heal          | WIS   |       |      |       |    1 |      |
|  +7 | History       | INT   |     5 |    2 |       |      |      |
|  +7 | Insight       | WIS   |     5 |      |       |    2 |      |
|  +5 | Intimidate    | CHA   |       |    4 |       |    1 |      |
|  +1 | Nature        | WIS   |       |      |       |    1 |      |
|  +6 | Perception    | WIS   |     5 |      |       |    1 |      |
|  +3 | Religion      | INT   |       |    2 |       |    1 |      |
|  +1 | Stealth       | DEX   |       |      |       |    1 |      |
|  +5 | Streetwise    | CHA   |       |    4 |       |    1 |      |
|  +1 | Theivery      | DEX   |       |      |       |    1 |      |
#+TBLFM: $5='(blank-if-zero (org-lookup-first $3 '(remote(Abilities,@2$1..@>$1)) '(remote(Abilities,@2$4..@>$4))))
#+TBLFM: $1='(concat "+" (int-to-string (+ $4 $5 $6 $7 $8)));N
- Skill Versatility: gain a +1 bonus to untrained skill checks
- Group Awareness from Sarjor grants allies a +1 racial bonus to Perception
- Bard class feature adds +2 Diplomacy and +2 Insight


** Equipment
| Name               | Quantity | Cost (gp) | Weight (lbs) | Total Weight (lbs) | Total Cost (gp) |
|--------------------+----------+-----------+--------------+--------------------+-----------------|
| Longbow            |        1 |        50 |            2 |                  2 |              50 |
| Longsword          |        1 |        15 |            4 |                  4 |              15 |
| Backpack           |        1 |         2 |            5 |                  5 |               2 |
| Bedroll            |        1 |        .1 |            2 |                  2 |             0.1 |
| Tinderbox          |        1 |        .5 |            1 |                  1 |             0.5 |
| Ration             |       10 |        .5 |            1 |                 10 |              5. |
| Waterskin          |        1 |        .2 |            5 |                  5 |             0.2 |
| Healing Potion     |        1 |        50 |           .1 |                0.1 |              50 |
| Hempen Rope (50ft) |        1 |         1 |           10 |                 10 |               1 |
| Arrows             |       60 |       .05 |           .1 |                 6. |              3. |
| Hide Armor         |        1 |        30 |           25 |                 25 |              30 |
|--------------------+----------+-----------+--------------+--------------------+-----------------|
| Carry Capacity     |      100 |           |              |               70.1 |           156.8 |
#+TBLFM: $5=($2 * $4)
#+TBLFM: $6=($2 * $3)
#+TBLFM: @>$5=vsum(@<<$5..@>>$5)
#+TBLFM: @>$6=vsum(@<<$6..@>>$6)


